common/models/AuthAssignment.php

    public function userRoleIDs($bkUrid)
    {
        $data = $this->find()->asArray()
            ->select(['auth_id'])
            ->where([
                'bkurid' => $bkUrid,
                'type' => 1,
                'status' => 1,
            ])
            ->all();
---
SELECT `auth_id` FROM `swim_auth_assignment` WHERE (`bkurid`=21) AND (`type`=1) AND (`status`=1)