common/models/AuthRole.php

    public function roles($roleIDs)
    {
        $data = $this->find()->asArray()
            ->select(['id','name'])
            ->where([
                'id' => $roleIDs,
                'status' => 1,
            ])
            ->all();
---
SELECT `id`, `name` FROM `swim_auth_role` WHERE (`id`='21') AND (`status`=1)