common/models/BkUser.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `swim_bk_user` WHERE (`username`='james666') AND (`status`=1)