common/libs/Helper.php

    public static function RecordOperationLog(array $log) {
        $log['operation_time'] = date('Y-m-d H:i:s');
        $log['ip'] = $_SERVER["REMOTE_ADDR"];
        $model = new OperationLog();
        $model->load($log,'');
        $model->save();
---
INSERT INTO `swim_operation_log` (`operation_id`, `operation_name`, `operation_model`, `operation_event`, `operation_time`, `ip`, `create_time`) VALUES (21, 'james666', '登录模块', '用户后台登录', '2021-11-17 14:28:42', '127.0.0.1', 1637130522)