api/dbmodels/dbUser.php

SELECT * FROM `swim_user_channel` WHERE (`urid`=21) AND (`status`=1)
UPDATE `swim_user_channel` SET `token`='jbe478c2nw2ar5h8' WHERE `id`=2100
SELECT * FROM `swim_user_channel_extra` WHERE (`user_channel_id`=2100) AND (`status`=1)
---
    public static function wxLoginNew($bk_model)
    {
        $connection = Yii::$app->db;
        $transaction = $connection->beginTransaction();
        try {
            //save UserChannel
            $userchannel = UserChannel::findOne(['urid' => $bk_model->id, 'status' => 1]);
            if (empty($userchannel)) {
                $transaction->rollBack();
                return false;
            } else {
                $userchannel->token = Utils::makeToken();
            }
            $ret = $userchannel->save();
            if (empty($ret)) {
                $transaction->rollBack();
                return false;
            }

            $transaction->commit();
        } catch (\Exception $e) {
            return false;
        }

        $userChannelExtra = UserChannelExtra::findOne([
            'user_channel_id' => $userchannel->id,
            'status' => UserChannelExtra::STATUS_VALID
        ]);