api/models/AddressCheck.php

SELECT COUNT(*) FROM (SELECT `ac`.`id` AS `check_id`, `ac`.`check_date`, `ac`.`check_status`, `ac`.`swim_address_id` FROM `swim_address_check` `ac` LEFT JOIN `swim_address` `a` ON a.id = ac.swim_address_id LEFT JOIN `swim_work_order_index` `w` ON w.address_check_id = ac.id WHERE (`ac`.`status`=1) AND (`w`.`info` LIKE '%2%') GROUP BY `check_id`) `c`
SELECT `ac`.`id` AS `check_id`, `ac`.`check_date`, `ac`.`check_status`, `ac`.`swim_address_id` FROM `swim_address_check` `ac` LEFT JOIN `swim_address` `a` ON a.id = ac.swim_address_id LEFT JOIN `swim_work_order_index` `w` ON w.address_check_id = ac.id WHERE (`ac`.`status`=1) AND (`w`.`info` LIKE '%2%') GROUP BY `check_id` ORDER BY `ac`.`check_date` DESC LIMIT 10
---
    public function checkManHistory($channel_id, $page, $limit, $check_status, $district, $item_id)
    {
        $channel_id = Utils::ecbDecrypt(\Yii::$app->params['channelIDKey'], $channel_id);
        $is_super_checker = UserChannelExtra::findOneArray(['status' => UserChannelExtra::NORMAL_STATUS, 'user_channel_id' => $channel_id],
                ['is_super_checker'])['is_super_checker'] ?? UserChannelExtra::SUPER_CHECKER_NO;
        $where = $is_super_checker == UserChannelExtra::SUPER_CHECKER_YES ? [
            'ac.status' => AddressCheck::NORMAL_STATUS,
        ] : [
            'ac.user_channel_id' => $channel_id,
            'ac.status' => AddressCheck::NORMAL_STATUS,
        ];
        $page = ($page > 0) ? $page : 1;
        $limit = ($limit > 0) ? $limit : 10;
        $start = ($page - 1) * $limit;
        $query = $this->find()->alias('ac')->asArray()
            ->select(['ac.id check_id', 'ac.check_date', 'ac.check_status', 'ac.swim_address_id'])
            ->leftJoin(\common\models\Address::tableName() . ' a', 'a.id = ac.swim_address_id')
            ->leftJoin(WorkOrderIndex::tableName() . ' w', 'w.address_check_id = ac.id')
            ->groupBy('check_id')
            ->where($where);
        if ($check_status) $query = $query->andWhere(['ac.check_status' => $check_status]);
        if ($district) $query = $query->andWhere(['a.district' => $district]);
        if ($item_id) $query = $query->andWhere(['like','w.info',$item_id]);
        $total = $query->count();
        $list = $query->orderBy([
            'ac.check_date' => SORT_DESC
        ])
            ->offset($start)->limit($limit)
            ->all();