api/models/AddressCheckDetail.php

    public function getCheckDetail($checkID)
    {
        $detailData = $this->find()
            ->select(['swim_address_check_item_id', 'result', 'check_status'])
            ->asArray()
            ->where([
                'swim_address_check_id' => $checkID,
                'status' => self::STATUS_VALID
            ])
            ->all();
---
SELECT `swim_address_check_item_id`, `result`, `check_status` FROM `swim_address_check_detail` WHERE (`swim_address_check_id`='830') AND (`status`=1)