api/models/AddressCheckItem.php

    public function getNameByID($id)
    {
        $data = $this->find()
            ->select(['name'])
            ->where(['id' => $id])
            ->one();
---
SELECT `name` FROM `swim_address_check_item` WHERE `id`='1'

    public function apiCheckList($addressID, $addressCheckID = false)
    {
        $checkList = $this->find()
            ->select(['id', 'name', 'pid', 'info', 'national_standard'])
            ->asArray()
            ->where([
                'status' => self::STATUS_VALID
            ])
            ->andWhere([
                '!=', 'info', ''
            ])
            ->orderBy([
                'weight' => SORT_DESC
            ])
            ->all();
---
SELECT `id`, `name`, `pid`, `info`, `national_standard` FROM `swim_address_check_item` WHERE (`status`=1) AND (`info` != '') ORDER BY `weight` DESC